In [ ]:
# assignment url
# https://drive.google.com/file/d/1ISetIhHbrX2_s8aUe5V0yMI4NwzBA32q/view

In [1]:
import numpy as np
import pandas as pd
from pandas.io.json import json_normalize

In [21]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

### 1 no solve

In [23]:
for i, dt in enumerate(df["FlightNumber"]):
    if(pd.isna(dt)):
        if(not pd.isna(df["FlightNumber"][i-1])):
            df["FlightNumber"][i] = df["FlightNumber"][i-1]+10
df.FlightNumber = df.FlightNumber.astype(int)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

### 2, 3 and 4 no solve

In [24]:
df['From'] = df['From_To'].str.split('_').str[0].str.capitalize()
df['To'] = df['From_To'].str.split('_').str[1].str.capitalize()
df.drop(['From_To'], axis=1, inplace=True)

In [26]:
# for i,data in enumerate(df['RecentDelays']):
#     if isinstance(data, list):
#         if(data):
#             for j,newdata in enumerate(data):
#                 df.iloc[i]['RecentDelays_'+str(j)] = newdata
# df

In [27]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [28]:
import re
df["Airline"] = df["Airline"].apply(lambda x: re.sub('\W+','', x ))

In [29]:
df

   FlightNumber  RecentDelays         Airline      From         To
0         10045      [23, 47]             KLM    London      Paris
1         10055            []     AirFrance12    Madrid      Milan
2         10065  [24, 43, 87]  BritishAirways    London  Stockholm
3         10075          [13]     12AirFrance  Budapest      Paris
4         10085      [67, 32]        SwissAir  Brussels     London

### 5 no solve

In [30]:
df2 = pd.DataFrame(df.RecentDelays.tolist(),columns=['RecentDelays0', 'RecentDelays1', 'RecentDelays2'])
df2

   RecentDelays0  RecentDelays1  RecentDelays2
0           23.0           47.0            NaN
1            NaN            NaN            NaN
2           24.0           43.0           87.0
3           13.0            NaN            NaN
4           67.0           32.0            NaN

In [40]:
for cl in df2.columns:
    df[cl] = df2[cl]

In [38]:
df.drop('RecentDelays', axis=1, inplace=True)

In [41]:
df

,FlightNumber,Airline,From,To,RecentDelays0,RecentDelays1,RecentDelays2
0,10045,KLM,London,Paris,23.0,47.0,NaN
1,10055,AirFrance12,Madrid,Milan,NaN,NaN,NaN
2,10065,BritishAirways,London,Stockholm,24.0,43.0,87.0
3,10075,12AirFrance,Budapest,Paris,13.0,NaN,NaN
4,10085,SwissAir,Brussels,London,67.0,32.0,NaN

In [10]:
# for i,dd in enumerate(df["RecentDelays"]):
#     if(isinstance(dd, list) ):

#         recenddl_data = np.nan
#         for j,data in enumerate(dd):
#             print(data)
#             df.iloc[i]
#             if(int(len(dd))> 0):
#                 print('data')
#             recenddl_data = data
#         else:
#             print('not data')
#         print('************')

# #             if(data):
# #                 recenddl_data = data
# #             print(recenddl_data)
# df